

public class VersionDiscript {

	// test2
/// <summary>
/// このクラスは何もしない、ただバージョン説明を内部で管理したかった。
/// </summary>
/*
	[1.0.0.1] 2017.5.28
	* 主に、前回のTODOに対し、作業をしていた。
	  * シフト演算でDebugMessagerManagerを実装した。
	  * 爆発のエフェクトを実装した。
	* ナンバープレートを実装した。
	  * 仕様としは、壊されていないブロックのみに対し検索を実行する。
	* 将来の開発に向けて、準備作業を行なった。

	* TODO 
	  * 現段階は難しいが、フィールドの分割機能を実装する。
	  * スースの中にはヌルポの可能性は結構あるので、いずれチェック処理を行う。
	  * ゲームステートの管理仕様作成
	
	
	[1.0.0.1] 2017.5.21
	* 主に本番開発に向けて、データー構成を決定した。
	　* リソースホルダーを統一し、ResourceManagerで管理するようにした。
		ただ、CreateInstanceにはBattleSceneを依存している部分があるので、なんとかしたい。
	　* Commonクラスに関しては、完全に独立させ、共通処理だけを待たせるようにした。
	* ソースマネジメントのために、爆弾をフィールドアイテムに統一した。
	　　ただ、将来の開発傾向を遠慮し、BombDataの中には自分のBombTypeを使用する。BombTypeはItemTypeの子となる。
	* BombManagerはあるけど、現段階には使わない。
	
	* TODO
	  * スースの中にはヌルポの可能性は結構あるので、いずれチェック処理を行う。
	  * デバッグメッセージが増えていくので、DebugMessagerManagerを作成。
	  * 爆弾の爆発エフェクトを作成
	  * ゲームステートの管理仕様作成

*/

}
